#  练习：(while2.py)
#         1. 写程序 打印1-20的整数，打印在一行显示，每个数字之间用空格分割
#         print(n, end = ' ')


# i = 1
# # while i <= 20:
# #     print(i, end = " ")
# #     i += 1
# # print()
#********************************************************************************
#         2.打印1-20的整数，每行打印5个，打印4行
# while i <= 20:
#     print(i, end = " ")
#     if i % 5 == 0:
#         print (" ")
#     i += 1
   
#********************************************************************************
    
# 3.输入一个整数吗打印一个宽度和高度都是n个字符的长方形     
# num = int(input("Enter a numer:"))
# print("#"*num)
# i = 1
# while i < num-1:
#     print("#"+" "*(num-2)+"#")
#     i += 1
# if num > 1:
#     print("#"*num) 

#********************************************************************************

# 4. 写程序，计算
#             1+2+3+4+5+.......100的和
# #             并打印结果

# i = 1
# n = 0
# while i < 101:
#     n += i
#     i += 1
# print(n)
#********************************************************************************

# 5.写程序
#             输入一个开始值用begin绑定
#             输入一个结束值用end绑定
#                 计算：
#                 从begin开始，到end结束的所有整数的和
#             如：
#                 请输入开始值：1
#                 请输入结束值：10
#             打印
# #                 和是：55

# begin = int(input("Begin:"))
# End = int(input("End:"))
# n = 0
# while begin <= End:
#     n += begin
#     begin +=1
# print(n) 
#********************************************************************************
#   6.写程序 
#             输入一个开始整数用变量begin绑定
#             输入一个结束整数用end绑定
#             打印从begin开始到end结束的每个整数，打印在一行内
# begin = int(input("Begin:"))
# End = int(input("End:"))
# n = 0
# while begin <= End:
#     print(begin, end = " ")
#     n += begin
#     begin +=1


#   完成后思考：
#             如何实现每5个整数打印在一行内，打印多行
begin = int(input("Begin:"))
End = int(input("End:"))
s = 0
n = 0
while begin <= End:
    print(begin, end = " ")
    s += begin
    begin +=1
    n +=1
    if n % 5 == 0:
        print()
print()
    



 