#练习：
    #１．输入一个季度　１－４　输出这个季度中哪几个月，
   # 　如果输入不是１－４的数，则提示用户您输错了
    #２．输入一年中的月份1-12, 输出这个月在哪几个季度。
   # 如果输入的是其他的数，则提示您输错了

# n = int(input("请输入一个季度１－４:"))
# if n == 1:
#     print("这个季度是１　２　３　月")
# elif n == 2:
#     print("这个季度是４　５　６　月")
# elif n == 3:
#     print("这个季度是7　8　9　月")
# elif n == 4:
#     print("这个季度是10 11 12 月")sd
# else:
#     print("您输错了")    


m = int(input("请输入１－１２的月份："))
if 1 <= m <=3:
    print(m,"月在第一季度")
elif 4 <= m <= 6:
    print(m,"月在第二季度")
elif 7 <= m <= 9:
    print(m,"月在第三季度")
elif 10 <= m <= 12:
    print(m,"月在第四季度")
else:
    print("您输错了")
