



# for x in range(4):
#     print(x)

# print('------------------')
# for y in range(3, 6):
#     print(y)

# print('~~~~~~~~~~~~~~~~~~~')
# for z in range(1, 10, 2):
#     print(z)

# 练习：
#         1.用for语句 打印 1 - 20 的整数打印在一行内.
#         2.用for语句 打印 1 - 20 的整数，每行打印5个， 打印4行.

# for x in range(1, 21):
#     print(x, end = " ")
# print()
    
  

# for x in range(1, 21):
    
#     print(x, end = " ")
#     if x % 5 == 0:
#         print()
# print()

#   3.求100 以内有那些触与自身+1的乘积再对11求余结果等于8
#             x * (x + 1) % 11 == 8
#         4.输入一段字符串，判断您输入的字符串中有几个中文字符：
#             （注：中文自读的编码值一定大于127）
# ****************************************    
# for x in range (100):
#     if (x * (x + 1) % 11) ==8:
#         print(x)
# #***********************************************

# a = input("请输入一段文字：")
# i = 0
# for b in a:
#     if ord(b) > 127:
#         i +=1
#     print(b, end =" ")
# print()
# print(i, "个")
#***********************************************


        


    